cat-harness/uml/overview/smart-immunizations.mmd
classDiagram
  direction TB
  namespace smart_immunizations__smart_immunizations_artifact_index {
    class smart_immunizations_smart_immunizations_artifact_index_folio_fhir_artifact_index_v1_Context["Context"] {
      <<json: FhirArtifactIndexSchema>>
    }
    class smart_immunizations_smart_immunizations_artifact_index_folio_fhir_artifact_index_v1_DakUnbound["DakUnbound"] {
      <<json: FhirArtifactIndexSchema>>
    }
    class smart_immunizations_smart_immunizations_artifact_index_folio_fhir_artifact_index_v1_Artifact["Artifact"] {
      <<json: FhirArtifactIndexSchema>>
    }
    class smart_immunizations_smart_immunizations_artifact_index_folio_fhir_artifact_index_v1_folio_fhir_artifact_index_v1["folio-fhir-artifact-index/v1"] {
      <<json: FhirArtifactIndexSchema>>
    }
    class smart_immunizations_smart_immunizations_artifact_index_https___json_schema_org_draft_2020_12_schema["JSON Schema 2020-12"] {
      <<ext: JSON Schema 2020-12>>
    }
  }
  smart_immunizations_smart_immunizations_artifact_index_folio_fhir_artifact_index_v1_folio_fhir_artifact_index_v1 *-- "0..*" smart_immunizations_smart_immunizations_artifact_index_folio_fhir_artifact_index_v1_Context : contexts
  smart_immunizations_smart_immunizations_artifact_index_folio_fhir_artifact_index_v1_folio_fhir_artifact_index_v1 *-- "0..*" smart_immunizations_smart_immunizations_artifact_index_folio_fhir_artifact_index_v1_DakUnbound : dakUnbound
  smart_immunizations_smart_immunizations_artifact_index_folio_fhir_artifact_index_v1_folio_fhir_artifact_index_v1 *-- "0..*" smart_immunizations_smart_immunizations_artifact_index_folio_fhir_artifact_index_v1_Artifact : artifacts
  cssClass "smart_immunizations_smart_immunizations_artifact_index_folio_fhir_artifact_index_v1_Context" fa_uml_kind_fhir_artifact_index
  cssClass "smart_immunizations_smart_immunizations_artifact_index_folio_fhir_artifact_index_v1_DakUnbound" fa_uml_kind_fhir_artifact_index
  cssClass "smart_immunizations_smart_immunizations_artifact_index_folio_fhir_artifact_index_v1_Artifact" fa_uml_kind_fhir_artifact_index
  cssClass "smart_immunizations_smart_immunizations_artifact_index_folio_fhir_artifact_index_v1_folio_fhir_artifact_index_v1" fa_uml_kind_fhir_artifact_index
  cssClass "smart_immunizations_smart_immunizations_artifact_index_https___json_schema_org_draft_2020_12_schema" fa_uml_kind_fhir_artifact_index
